tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# General-purpose data compression with high compression ratio
brew "xz"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Pager program similar to more
brew "less"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Rust toolchain installer
brew "rustup-init"
# Tool Command Language
brew "tcl-tk"
# Vi 'workalike' with many additional features
brew "vim"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Stand alone ad blocker
cask "adguard"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Software for Logitech devices
cask "logi-options-plus"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Administration tool for Native Instruments products
cask "native-access"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source code editor
cask "visual-studio-code"
mas "Auto HD FPS for YouTube", id: 1546729687
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Things", id: 904280696
mas "Xcode", id: 497799835
